zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_dmamux.h
#if defined DMAMUX2
#define LL_DMAMUX2_REQ_SEC_MEM2MEM          0U  /*!< memory to memory transfer        */
#define LL_DMAMUX2_REQ_SEC_GENERATOR0       1U  /*!< DMAMUX2 request generator 0      */
#define LL_DMAMUX2_REQ_SEC_GENERATOR1       2U  /*!< DMAMUX2 request generator 1      */
#define LL_DMAMUX2_REQ_SEC_GENERATOR2       3U  /*!< DMAMUX2 request generator 2      */
#define LL_DMAMUX2_REQ_SEC_GENERATOR3       4U  /*!< DMAMUX2 request generator 3      */
#define LL_DMAMUX2_REQ_SEC_GENERATOR4       5U  /*!< DMAMUX2 request generator 4      */
#define LL_DMAMUX2_REQ_SEC_GENERATOR5       6U  /*!< DMAMUX2 request generator 5      */
#define LL_DMAMUX2_REQ_SEC_GENERATOR6       7U  /*!< DMAMUX2 request generator 6      */
#define LL_DMAMUX2_REQ_SEC_GENERATOR7       8U  /*!< DMAMUX2 request generator 7      */
#define LL_DMAMUX2_REQ_SEC_ADC1             9U   /*!< DMAMUX2 ADC1 request */
#define LL_DMAMUX2_REQ_SEC_ADC2             10U  /*!< DMAMUX2 ADC2 request */
#define LL_DMAMUX2_REQ_SEC_I2C3_RX          11U  /*!< DMAMUX2 I2C3 RX request   */
#define LL_DMAMUX2_REQ_SEC_I2C3_TX          12U  /*!< DMAMUX2 I2C3 TX request   */
#define LL_DMAMUX2_REQ_SEC_SPI4_RX          13U  /*!< DMAMUX2 SPI4 RX request   */
#define LL_DMAMUX2_REQ_SEC_SPI4_TX          14U  /*!< DMAMUX2 SPI4 TX request   */
#define LL_DMAMUX2_REQ_SEC_USART1_RX        15U  /*!< DMAMUX2 USART1 RX request */
#define LL_DMAMUX2_REQ_SEC_USART1_TX        16U  /*!< DMAMUX2 USART1 TX request */
#define LL_DMAMUX2_REQ_SEC_USART2_RX        17U  /*!< DMAMUX2 USART2 RX request */
#define LL_DMAMUX2_REQ_SEC_USART2_TX        18U  /*!< DMAMUX2 USART2 TX request */
#define LL_DMAMUX2_REQ_SEC_I2C4_RX          19U  /*!< DMAMUX2 I2C4 RX request     */
#define LL_DMAMUX2_REQ_SEC_I2C4_TX          20U  /*!< DMAMUX2 I2C4 TX request     */
#define LL_DMAMUX2_REQ_SEC_I2C5_RX          21U  /*!< DMAMUX2 I2C5 RX request     */
#define LL_DMAMUX2_REQ_SEC_I2C5_TX          22U  /*!< DMAMUX2 I2C5 TX request     */
#define LL_DMAMUX2_REQ_SEC_SPI5_RX          23U  /*!< DMAMUX2 SPI5 RX request   */
#define LL_DMAMUX2_REQ_SEC_SPI5_TX          24U  /*!< DMAMUX2 SPI5 TX request   */
#define LL_DMAMUX2_REQ_SEC_TIM15_CH1        25U  /*!< DMAMUX2 TIM15 CH1 request  */
#define LL_DMAMUX2_REQ_SEC_TIM15_UP         26U  /*!< DMAMUX2 TIM15 UP request   */
#define LL_DMAMUX2_REQ_SEC_TIM15_TRIG       27U  /*!< DMAMUX2 TIM15 TRIG request */
#define LL_DMAMUX2_REQ_SEC_TIM15_COM        28U  /*!< DMAMUX2 TIM15 COM request  */
#define LL_DMAMUX2_REQ_SEC_TIM16_CH1        29U  /*!< DMAMUX2 TIM16 CH1 request  */
#define LL_DMAMUX2_REQ_SEC_TIM16_UP         30U  /*!< DMAMUX2 TIM16 UP request   */
#define LL_DMAMUX2_REQ_SEC_TIM17_CH1        31U  /*!< DMAMUX2 TIM17 CH1 request  */
#define LL_DMAMUX2_REQ_SEC_TIM17_UP         32U  /*!< DMAMUX2 TIM17 UP request   */
#endif /* DMAMUX2 */
/**
  * @}
  */


/** @defgroup DMAMUX_LL_EC_CHANNEL DMAMUX Channel
  * @{
  */
#define LL_DMAMUX_CHANNEL_0     0x00000000U  /*!< DMAMUX1 Channel 0 connected to DMA1 Channel 0 */
#define LL_DMAMUX_CHANNEL_1     0x00000001U  /*!< DMAMUX1 Channel 1 connected to DMA1 Channel 1 */
#define LL_DMAMUX_CHANNEL_2     0x00000002U  /*!< DMAMUX1 Channel 2 connected to DMA1 Channel 2 */
#define LL_DMAMUX_CHANNEL_3     0x00000003U  /*!< DMAMUX1 Channel 3 connected to DMA1 Channel 3 */
#define LL_DMAMUX_CHANNEL_4     0x00000004U  /*!< DMAMUX1 Channel 4 connected to DMA1 Channel 4 */
#define LL_DMAMUX_CHANNEL_5     0x00000005U  /*!< DMAMUX1 Channel 5 connected to DMA1 Channel 5 */
#define LL_DMAMUX_CHANNEL_6     0x00000006U  /*!< DMAMUX1 Channel 6 connected to DMA1 Channel 6 */
#define LL_DMAMUX_CHANNEL_7     0x00000007U  /*!< DMAMUX1 Channel 7 connected to DMA1 Channel 7 */
#define LL_DMAMUX_CHANNEL_8     0x00000008U  /*!< DMAMUX1 Channel 8 connected to DMA2 Channel 0  */
#define LL_DMAMUX_CHANNEL_9     0x00000009U  /*!< DMAMUX1 Channel 9 connected to DMA2 Channel 1  */
#define LL_DMAMUX_CHANNEL_10    0x0000000AU  /*!< DMAMUX1 Channel 10 connected to DMA2 Channel 2 */
#define LL_DMAMUX_CHANNEL_11    0x0000000BU  /*!< DMAMUX1 Channel 11 connected to DMA2 Channel 3 */
#define LL_DMAMUX_CHANNEL_12    0x0000000CU  /*!< DMAMUX1 Channel 12 connected to DMA2 Channel 4 */
#define LL_DMAMUX_CHANNEL_13    0x0000000DU  /*!< DMAMUX1 Channel 13 connected to DMA2 Channel 5 */
#define LL_DMAMUX_CHANNEL_14    0x0000000EU  /*!< DMAMUX1 Channel 14 connected to DMA2 Channel 6 */
#define LL_DMAMUX_CHANNEL_15    0x0000000FU  /*!< DMAMUX1 Channel 15 connected to DMA2 Channel 7 */
/**
  * @}
  */

/** @defgroup DMAMUX_LL_EC_SYNC_NO Synchronization Signal Polarity
  * @{
  */
#define LL_DMAMUX_SYNC_NO_EVENT            0x00000000U                               /*!< All requests are blocked   */
#define LL_DMAMUX_SYNC_POL_RISING          DMAMUX_CxCR_SPOL_0                        /*!< Synchronization on event on rising edge */
#define LL_DMAMUX_SYNC_POL_FALLING         DMAMUX_CxCR_SPOL_1                        /*!< Synchronization on event on falling edge */
#define LL_DMAMUX_SYNC_POL_RISING_FALLING  (DMAMUX_CxCR_SPOL_0 | DMAMUX_CxCR_SPOL_1) /*!< Synchronization on event on rising and falling edge */
/**
  * @}
  */

/** @defgroup DMAMUX_LL_EC_SYNC_EVT Synchronization Signal Event
  * @{
  */
#define LL_DMAMUX1_SYNC_DMAMUX1_CH0_EVT   0x00000000U   /*!< DMAMUX1 synchronization Signal is DMAMUX1 Channel0 Event */
#define LL_DMAMUX1_SYNC_DMAMUX1_CH1_EVT   0x01000000U   /*!< DMAMUX1 synchronization Signal is DMAMUX1 Channel1 Event */
#define LL_DMAMUX1_SYNC_DMAMUX1_CH2_EVT   0x02000000U   /*!< DMAMUX1 synchronization Signal is DMAMUX1 Channel2 Event */
#define LL_DMAMUX1_SYNC_LPTIM1_OUT        0x03000000U   /*!< DMAMUX1 synchronization Signal is LPTIM1 OUT             */
#define LL_DMAMUX1_SYNC_LPTIM2_OUT        0x04000000U   /*!< DMAMUX1 synchronization Signal is LPTIM2 OUT             */
#define LL_DMAMUX1_SYNC_LPTIM3_OUT        0x05000000U   /*!< DMAMUX1 synchronization Signal is LPTIM3 OUT             */
#define LL_DMAMUX1_SYNC_EXTI0             0x06000000U   /*!< DMAMUX1 synchronization Signal is EXTI0 IT               */
#define LL_DMAMUX1_SYNC_TIM12_TRGO        0x07000000U   /*!< DMAMUX1 synchronization Signal is TIM12 TRGO             */
#define LL_DMAMUX2_SYNC_DMAMUX2_CH0_EVT   0x00000000U   /*!< DMAMUX2 synchronization Signal is DMAMUX2 Channel0 Event */
#define LL_DMAMUX2_SYNC_DMAMUX2_CH1_EVT   0x01000000U   /*!< DMAMUX2 synchronization Signal is DMAMUX2 Channel1 Event */
#define LL_DMAMUX2_SYNC_DMAMUX2_CH2_EVT   0x02000000U   /*!< DMAMUX2 synchronization Signal is DMAMUX2 Channel2 Event */
#define LL_DMAMUX2_SYNC_TIM12_TRGO        0x07000000U   /*!< DMAMUX2 synchronization Signal is TIM12 TRGO             */
/**
  * @}
  */

/** @defgroup DMAMUX_LL_EC_REQUEST_GENERATOR Request Generator Channel
  * @{
  */
#define LL_DMAMUX_REQ_GEN_0           0x00000000U
#define LL_DMAMUX_REQ_GEN_1           0x00000001U
#define LL_DMAMUX_REQ_GEN_2           0x00000002U
#define LL_DMAMUX_REQ_GEN_3           0x00000003U
#define LL_DMAMUX_REQ_GEN_4           0x00000004U
#define LL_DMAMUX_REQ_GEN_5           0x00000005U
#define LL_DMAMUX_REQ_GEN_6           0x00000006U
#define LL_DMAMUX_REQ_GEN_7           0x00000007U
/**
  * @}
  */

